ErpTest/src/Documents/уатОтчетПоставщикаПЦ/уатОтчетПоставщикаПЦ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>уатОтчетПоставщикаПЦ</name>
  <comment>(уат)</comment>
  <registerRecords>AccumulationRegister.уатОборотыПоОтчетамПоставщиковПЦ</registerRecords>
  <attributes>
    <name>АЗС</name>
    <type>
      <types>CatalogRef.уатАЗС</types>
    </type>
  </attributes>
  <attributes>
    <name>ВалютаДокумента</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Заправки</name>
    <attributes>
      <name>ГСМ</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Дата</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>МестоЗаправкиКод</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>25</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>МестоЗаправкиНаименование</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НоменклатураОтчета</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>30</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПластиковаяКарта</name>
      <type>
        <types>CatalogRef.уатТопливныеКарты</types>
      </type>
    </attributes>
    <attributes>
      <name>ПластиковаяКартаОтчета</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>25</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Проверено</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТС</name>
      <type>
        <types>CatalogRef.ТранспортныеСредства</types>
      </type>
    </attributes>
    <attributes>
      <name>ТСОтчета</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ErpTest/src/Documents/уатОтчетПоставщикаПЦ/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

// Инициализирует таблицы значений, содержащие данные табличных частей документа.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура ИнициализироватьДанныеДокумента(ДокументСсылка, СтруктураДополнительныеСвойства) Экспорт
	мЗапрос = Новый Запрос;
	мЗапрос.Текст = 
	"ВЫБРАТЬ
	|	ТабЧастьДокумента.Ссылка КАК Регистратор,
	|	ТабЧастьДокумента.Ссылка.АЗС КАК АЗС,
	|	ТабЧастьДокумента.Ссылка.Организация КАК Организация,
	|	ТабЧастьДокумента.Ссылка.ВалютаДокумента КАК Валюта,
	|	ТабЧастьДокумента.Дата КАК Период,
	|	ТабЧастьДокумента.Проверено КАК Проверено,
	|	ТабЧастьДокумента.ПластиковаяКартаОтчета КАК ПластиковаяКартаОтчета,
	|	ТабЧастьДокумента.НоменклатураОтчета КАК НоменклатураОтчета,
	|	ТабЧастьДокумента.ТСОтчета КАК ТСОтчета,
	|	ТабЧастьДокумента.ПластиковаяКарта КАК ПластиковаяКарта,
	|	ТабЧастьДокумента.ТС КАК ТС,
	|	ТабЧастьДокумента.ГСМ КАК Номенклатура,
	|	ТабЧастьДокумента.Количество КАК Количество,
	|	ТабЧастьДокумента.Сумма КАК Стоимость,
	|	ТабЧастьДокумента.Сумма КАК СтоимостьУпр
	|ИЗ
	|	Документ.уатОтчетПоставщикаПЦ.Заправки КАК ТабЧастьДокумента
	|ГДЕ
	|	ТабЧастьДокумента.Ссылка = &Ссылка
	|";
	мЗапрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	
	ТаблицаОборотыПоОтчетамПоставщиковПЦ = мЗапрос.Выполнить().Выгрузить();
	
	Для Каждого ТекСтрока ИЗ ТаблицаОборотыПоОтчетамПоставщиковПЦ Цикл
		мКурсВалютыСтруктура = уатОбщегоНазначенияТиповые.ПолучитьКурсВалюты(ДокументСсылка.ВалютаДокумента, ТекСтрока.Период);
		
		Если СтруктураДополнительныеСвойства.ВалютаРеглУчета <> ДокументСсылка.ВалютаДокумента тогда
			ТекСтрока.Стоимость = уатОбщегоНазначенияТиповые.ПересчитатьИзВалютыВВалюту(ТекСтрока.Стоимость, ДокументСсылка.ВалютаДокумента, 
		   						СтруктураДополнительныеСвойства.ВалютаРеглУчета,
								мКурсВалютыСтруктура.Курс, 
								СтруктураДополнительныеСвойства.КурсРегл,
								мКурсВалютыСтруктура.Кратность,  
								СтруктураДополнительныеСвойства.КратностьРегл);
		КонецЕсли;
		
		Если СтруктураДополнительныеСвойства.Свойство("ВалютаУпрУчета") И СтруктураДополнительныеСвойства.ВалютаУпрУчета <> ДокументСсылка.ВалютаДокумента тогда
			ТекСтрока.СтоимостьУпр = уатОбщегоНазначенияТиповые.ПересчитатьИзВалютыВВалюту(ТекСтрока.СтоимостьУпр, ДокументСсылка.ВалютаДокумента,
								СтруктураДополнительныеСвойства.ВалютаУпрУчета, 
								мКурсВалютыСтруктура.Курс, 
								СтруктураДополнительныеСвойства.КурсУпр,
								мКурсВалютыСтруктура.Кратность,  
								СтруктураДополнительныеСвойства.КратностьУпр);
		Иначе
			ТекСтрока.СтоимостьУпр = 0;								
		КонецЕсли;
	КонецЦикла;
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаОборотыПоОтчетамПоставщиковПЦ", ТаблицаОборотыПоОтчетамПоставщиковПЦ);
КонецПроцедуры // ИнициализироватьДанныеДокумента()

// Выполняет контроль возникновения отрицательных остатков.
//
Процедура ВыполнитьКонтроль(ДокументСсылка, ДополнительныеСвойства, Отказ, УдалениеПроведения = Ложь) Экспорт
	//зарезервировано
КонецПроцедуры // ВыполнитьКонтроль()

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати – ТаблицаЗначений – состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	Заглушка = Истина;
КонецПроцедуры

// СтандартныеПодсистемы.ВерсионированиеОбъектов
// Определяет настройки объекта для подсистемы ВерсионированиеОбъектов.
//
// Параметры:
//  Настройки - Структура - настройки подсистемы.
Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт
	Заглушка = Истина;
КонецПроцедуры
// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов

#КонецЕсли
